tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/rotateControlFoil/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
11961
(
(1.00018 -0.000296262 -2.92193e-22)
(1.00018 -0.000298022 1.32025e-22)
(1.00019 -0.000229433 1.99409e-22)
(1.00017 -0.000315757 1.21254e-21)
(1.00023 -0.000230339 2.44411e-22)
(1.00019 -0.00023741 -1.52603e-26)
(1.0002 -0.00022686 2.36968e-22)
(1.00019 -0.000277814 -4.39429e-22)
...
)
;

boundaryField
{
    airfoil
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
