tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/rotateControlFoil/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
1.79263e-05
2.01055e-05
3.3628e-06
3.15632e-05
-4.20726e-06
1.67727e-05
1.87937e-06
1.30007e-05
...
)
;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
