tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/rotateControlFoil/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
6.97468e-17
1.37227e-16
1.76977e-19
4.00347e-16
7.69357e-22
8.64173e-19
1.3436e-19
7.65754e-17
...
)
;

boundaryField
{
    airfoil
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 6.1605e-05;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
