tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/rotateControlFoil/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
3.5542e+12
3.28834e+12
6.26279e+13
1.1547e+11
2.27924e+13
4.16235e+12
9.24701e+13
2.94971e+10
...
)
;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 0.600601;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 0.600601;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
