tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/rotateControlFoil/system/remeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      PIDcontrolDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

language python3;
script remeshCaller.py;
mesher pointwise;
logFile testlog;
option1 b; // dirty coding here to add '-' inside the meshing command
option2 meshUnstructuredRotate.glf;
option3 parameters.dat;
